// 1 Дано два числа a і b.
// Потрібно написати функцію, яка обчислює та повертає їхню суму

// const summ = (num1, num2) => {
//   let result = num1 + num2;
//   return result;
// };

// console.log(summ(10, 10));

// 2

// Дано число age, яке означає вік людини.
// Напишіть програму на JavaScript, яка:
//  • якщо вік 18 років або більше — виводить повідомлення «Доступ дозволено»
//  • якщо вік менше 18 років — виводить повідомлення «Доступ заборонено

// const checkAge = function (currentAge) {
//   if (currentAge >= 18) {
//     console.log('Доступ дозволено');
//   } else {
//     console.log('Доступ заборонено');
//   }
// };
// checkAge(22);
