// 1 ---------------------------------------------------------------
// Дано два числа a і b.
// Потрібно написати функцію, яка обчислює та повертає їхню суму

// const summ = (num1, num2) => {
//   let result = num1 + num2;
//   return result;
// };

// console.log(summ(10, 10));

// 2-----------------------------------------------------------------

// Дано число age, яке означає вік людини.
// Напишіть програму на JavaScript, яка:
//  • якщо вік 18 років або більше — виводить повідомлення «Доступ дозволено»
//  • якщо вік менше 18 років — виводить повідомлення «Доступ заборонено

// const checkAge = function (currentAge) {
//   if (currentAge >= 18) {
//     console.log('Доступ дозволено');
//   } else {
//     console.log('Доступ заборонено');
//   }
// };
// checkAge(22);

//     3----------------------------------------------------------------------
//  Оголосіть дві змінні: admin та name.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в admin.
// Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).

// let admin;
// let name = 'Ivan';
// admin = name;
// alert(admin);

//   4------------------------------------------------------------------------
// let name = "Ілля";

// alert( `привіт ${1}` ); // привіт 1

// alert( `привіт ${"name"}` ); //  привіт name

// alert( `привіт ${name}` ); // привіт Ілля

//  5----------------------------------------------------------------------
// Створіть вебсторінку, яка запитує ім’я та виводить його.

// let name = prompt('Введіть ваше ім я');
// alert(name);

//   6-----------------------------------------------------------------------
// let a = 1,
//   b = 1;

// let c = ++a;  1+1=2
// let d = b++;  1*1=1

// let a = 2;

// let x = 1 + (a *= 2); //5

// 7-------------------------------------------------------------------------
// Якщо змінна більше нуля - виведіть true, менше - false
//Перевірте це на варіантах 1, 0, -3

// let a;
// console.log(a > 0);

//  8------------------------------------------------------------------------
// Напиши функцію, яка приймає число і визначає:
// якщо число парне — вивести "Even"
// якщо число непарне — вивести "Odd"

// const c = function (num) {
//   if (num % 2 === 0) {
//     console.log('Even');
//   } else {
//     console.log('Odd');
//   }
// };

// c();
//  9----------------------------------------------------------------------
// Є масив чисел. Знайти суму всіх чисел

// const arr = [1, 2, 3, 4];

// function arraySum(nums) {
//   let sum = 0;
//   for (let i = 0; b < nums.length; i++) {
//     sum += nums[i];
//   }
//   console.log(sum);
// }
// arraySum(arr);

//  10-----------------------------------------------------------------------
// // Дано масив const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// // Отримати лише парні числа, результат вивести в консоль
// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// function getEvenNumbers(nums) {
//   const result = [];

//   for (let i = 0; i < nums.length; i++) {
//     if (nums[i] % 2 === 0) {
//       result.push(nums[i]);
//     }
//   }

//   return result;
// }

// const arr2 = getEvenNumbers(arr);
// console.log(arr2);

// 11-----------------------------------------------------------
// Якщо змінна більше нуля - виведіть true, менше - false
//Перевірте це на варіантах 1, 0, -3.

// let a = 1;
// if (a > 0) {
//   console.log(true);
// } else console.log(false);

// 12-------------------------------------
//  Якщо змінна ="test" - виведіть true,
//Перевірте це на варіантах 'test', "qwerty", true
// let a = 'true';
// if (a === 'test') {
//   console.log(true);
// }

// 13--------------------------------------------------------------

// Якщо змінна більше 10 - відніміть 5,
//менше - додайте 5, результат виведіть в консоль
//Перевірте це на варіантах 1, 10, 13.

// let a = 1;
// if (a > 10) {
//   console.log(a - 5);
// } else {
//   console.log(a + 5);
// }

// 14-----------------------------------------------------
//Зробіть сервіс який отримує число від 1 до 12
// виведіть місяць який дорівнює числу

// const a = Number(prompt('Введіть номер місяця (1-12)'));
// let month;

// switch (a) {
//   case 1:
//     month = 'Січень';
//     break;
//   case 2:
//     month = 'Лютий';
//     break;
//   case 3:
//     month = 'Березень';
//     break;
//   case 4:
//     month = 'Квітень';
//     break;
//   case 5:
//     month = 'Травень';
//     break;
//   case 6:
//     month = 'Червень';
//     break;
//   case 7:
//     month = 'Липень';
//     break;
//   case 8:
//     month = 'Серпень';
//     break;
//   case 9:
//     month = 'Вересень';
//     break;
//   case 10:
//     month = 'Жовтень';
//     break;
//   case 11:
//     month = 'Листопад';
//     break;
//   case 12:
//     month = 'Грудень';
//     break;
//   default:
//     alert('Помилка: введіть число від 1 до 12');
//     break;
//

// 15---------------------------------------------------
//Зробіть сервіс який отримує тризначне число
//Поверніть користувачу сумму цих чисел

// let numberStr = prompt("Введіть тризначне число");

// let num1 = Number(numberStr[0]);
// let num2 = Number(numberStr[1]);
// let num3 = Number(numberStr[2]);

// let sum = num1 + num2 + num3;

// alert("Сума цифр числа " + numberStr + " дорівнює: " + sum);

//  16----------------------------------------------------
// Перепишіть функцію, використовуючи '?' або '||'
// function checkAge(age) {
// if (age > 18) {
// return true;
// } else {
// return confirm('Батьки дозволили?');
// }
// }

//return (age > 18) ? true : confirm('Батьки дозволили?');

//  17-----------------------------------------------------
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.

// function min(a, b) {
//   return Math.min(a, b);
// }

// min(2, 58);

//  18------------------------Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:
// function ask(question, yes, no) {
// if (confirm(question)) yes();
// else no();
// }
// ask(
// "Ви згодні?"
// ,
// function() { alert("Ви погодились."); },
// function() { alert("Ви скасували виконання."); }
// )

// const ask = (question, yes, no) => {
//   if (confirm(question)) yes();
//   else no();
// };
// ask(
//   'Ви згодні?',
//   function () {
//     alert('Ви погодились.');
//   },
//   function () {
//     alert('Ви скасували виконання.');
//   },
// );
