// 1 ---------------------------------------------------------------
// Дано два числа a і b.
// Потрібно написати функцію, яка обчислює та повертає їхню суму

// const summ = (num1, num2) => {
//   let result = num1 + num2;
//   return result;
// };

// console.log(summ(10, 10));

// 2-----------------------------------------------------------------

// Дано число age, яке означає вік людини.
// Напишіть програму на JavaScript, яка:
//  • якщо вік 18 років або більше — виводить повідомлення «Доступ дозволено»
//  • якщо вік менше 18 років — виводить повідомлення «Доступ заборонено

// const checkAge = function (currentAge) {
//   if (currentAge >= 18) {
//     console.log('Доступ дозволено');
//   } else {
//     console.log('Доступ заборонено');
//   }
// };
// checkAge(22);

//3----------------------------------------------------------------------
//  Оголосіть дві змінні: admin та name.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в admin.
// Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).

// let admin;
// let name = 'Ivan';
// admin = name;
// alert(admin);

//4------------------------------------------------------------------------
// let name = "Ілля";

// alert( `привіт ${1}` ); // привіт 1

// alert( `привіт ${"name"}` ); //  привіт name

// alert( `привіт ${name}` ); // привіт Ілля

//5----------------------------------------------------------------------
// Створіть вебсторінку, яка запитує ім’я та виводить його.

// let name = prompt('Введіть ваше ім я');
// alert(name);

//6-----------------------------------------------------------------------
// let a = 1,
//   b = 1;

// let c = ++a;  1+1=2
// let d = b++;  1*1=1

// let a = 2;

// let x = 1 + (a *= 2); //5
//-------------------------------------------------------------------------
// Якщо змінна більше нуля - виведіть true, менше - false
//Перевірте це на варіантах 1, 0, -3

// let a;
// console.log(a > 0);

//------------------------------------------------------------------------
// Напиши функцію, яка приймає число і визначає:
// якщо число парне — вивести "Even"
// якщо число непарне — вивести "Odd"

// const c = function (num) {
//   if (num % 2 === 0) {
//     console.log('Even');
//   } else {
//     console.log('Odd');
//   }
// };

// c();
//----------------------------------------------------------------------
// Є масив чисел. Знайти суму всіх чисел

// const arr = [1, 2, 3, 4];

// function arraySum(nums) {
//   let sum = 0;
//   for (let i = 0; b < nums.length; i++) {
//     sum += nums[i];
//   }
//   console.log(sum);
// }
// arraySum(arr);

//-----------------------------------------------------------------------
// // Дано масив const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// // Отримати лише парні числа, результат вивести в консоль
// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// function getEvenNumbers(nums) {
//   const result = [];

//   for (let i = 0; i < nums.length; i++) {
//     if (nums[i] % 2 === 0) {
//       result.push(nums[i]);
//     }
//   }

//   return result;
// }

// const arr2 = getEvenNumbers(arr);
// console.log(arr2);
